Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/midware/usb_host_lib/host_core/usbh_core.c
    /* Enable Interrupts */
    USB_OTG_BSP_EnableInterrupt();
}

/**
 * @brief  USBH_DeInit
 *         Re-Initialize Host
 * @param  None
 * @retval status: USBH_Status
 */
USBH_Status USBH_DeInit(USB_OTG_CORE_HANDLE *pdev, USBH_HOST *phost)
{
    /* Software Init */
    phost->gState = HOST_IDLE;
    phost->gStateBkp = HOST_IDLE;
    phost->EnumState = ENUM_IDLE;
    phost->RequestState = CMD_SEND;

    phost->Control.state = CTRL_SETUP;
    phost->Control.ep0size = USB_OTG_MAX_EP0_SIZE;

    phost->device_prop.address = USBH_DEVICE_ADDRESS_DEFAULT;
    phost->device_prop.speed = HPRT0_PRTSPD_FULL_SPEED;

    USBH_Free_Channel  (pdev, phost->Control.hc_num_in);
    USBH_Free_Channel  (pdev, phost->Control.hc_num_out);
    return USBH_OK;
}

/**
 * @brief  USBH_Process
 *         USB Host core main state machine process
 * @param  None
 * @retval None
 */
void USBH_Process(USB_OTG_CORE_HANDLE *pdev , USBH_HOST *phost)
{
    volatile USBH_Status status = USBH_FAIL;
    static  int tet = (int)0;
    /* check for Host port events */
    if ((HCD_IsDeviceConnected(pdev) == 0UL)&& (phost->gState != HOST_IDLE))
    {
        if(phost->gState != HOST_DEV_DISCONNECTED)
        {
            if ((phost->device_prop.speed == USB_SPEED_LOW) && (phost->gState == HOST_DEV_ATTACHED))
            {
                phost->gState = HOST_DEV_ATTACHED;
            }
            else
            {
                if(tet == (int)0)
                {
                    phost->gState = HOST_DEV_DISCONNECTED;
                }
            }
        }
    }

    switch (phost->gState)
    {
        case HOST_IDLE :
            if (HCD_IsDeviceConnected(pdev))
            {
            phost->gState = HOST_DEV_ATTACHED;
            USB_OTG_BSP_mDelay(100UL);
            }
            break;

        case HOST_DEV_ATTACHED :
            phost->usr_cb->DeviceAttached();
            phost->Control.hc_num_out = USBH_Alloc_Channel(pdev, 0x00U);
            phost->Control.hc_num_in = USBH_Alloc_Channel(pdev, 0x80U);

            /* Reset USB Device */
            //if ( HCD_ResetPort(pdev) == 0U) /* MISRAC 2004*/
            HCD_ResetPort(pdev);
            //{
                phost->usr_cb->ResetDevice();
                /*  Wait for USB USBH_ISR_PrtEnDisableChange()
                Host is Now ready to start the Enumeration  */
                phost->device_prop.speed = (uint8_t)HCD_GetCurrentSpeed(pdev);

                phost->gState = HOST_ENUMERATION;
                phost->usr_cb->DeviceSpeedDetected(phost->device_prop.speed);

                /* Open Control pipes */
                USBH_Open_Channel (pdev,
                                    phost->Control.hc_num_in,
                                    phost->device_prop.address,
                                    phost->device_prop.speed,
                                    EP_TYPE_CTRL,
                                    (uint16_t)phost->Control.ep0size);

                /* Open Control pipes */
                USBH_Open_Channel (pdev,
                                    phost->Control.hc_num_out,
                                    phost->device_prop.address,
                                    phost->device_prop.speed,
                                    EP_TYPE_CTRL,
                                    (uint16_t)phost->Control.ep0size);
            //}
            break;

        case HOST_ENUMERATION:
            /* Check for enumeration status */
            if ( USBH_HandleEnum(pdev , phost) == USBH_OK)
            {
                /* The function shall return USBH_OK when full enumeration is complete */
                /* user callback for end of device basic enumeration */
                phost->usr_cb->EnumerationDone();

                phost->gState  = HOST_USR_INPUT;
            }
            break;
        case HOST_USR_INPUT:
            /*The function should return user response true to move to class state */
            if((phost->class_cb->Init(pdev, phost)) == USBH_OK)
            {
                phost->gState  = HOST_CLASS_REQUEST;
            }
            break;
        case HOST_CLASS_REQUEST:
            /* process class standard contol requests state machine */
            status = phost->class_cb->Requests(pdev, phost);
            if(status == USBH_OK)
            {
            phost->gState  = HOST_CLASS;
            }
            else
            {
            USBH_ErrorHandle(phost, status);
            }
            break;
        case HOST_CLASS:
            /* process class state machine */
            status = phost->class_cb->Machine(pdev, phost);
            USBH_ErrorHandle(phost, status);
            break;
        case HOST_CTRL_XFER:
            /* process control transfer state machine */
            USBH_HandleControl(pdev, phost);
            break;
        case HOST_SUSPENDED:
            break;
        case HOST_ERROR_STATE:
            /* Re-Initialize Host for new Enumeration */
            USBH_DeInit(pdev, phost);
            phost->usr_cb->DeInit();
            phost->class_cb->DeInit(pdev, &phost->device_prop);
            break;
        case HOST_DEV_DISCONNECTED :
            /* Manage User disconnect operations*/
            phost->usr_cb->DeviceDisconnected();

            /* Re-Initialize Host for new Enumeration */
            USBH_DeInit(pdev, phost);
            phost->usr_cb->DeInit();
            phost->class_cb->DeInit(pdev, &phost->device_prop);
            USBH_DeAllocate_AllChannel(pdev);
            phost->gState = HOST_IDLE;
            break;
        default :
            break;
    }
}

/**
  * \brief  USBH_ErrorHandle
  *         This function handles the Error on Host side.
  * \param  errType : Type of Error or Busy/OK state
  * \retval None
 */
void USBH_ErrorHandle(USBH_HOST *phost, USBH_Status errType)
{
    /* Error unrecovered or not supported device speed */
    if ( (errType == USBH_ERROR_SPEED_UNKNOWN) || (errType == USBH_UNRECOVERED_ERROR) )
    {
        phost->usr_cb->UnrecoveredError();
        phost->gState = HOST_ERROR_STATE;
    }
    /* USB host restart requested from application layer */
    else if(errType == USBH_APPLY_DEINIT)
    {
        phost->gState = HOST_ERROR_STATE;
        /* user callback for initalization */
        phost->usr_cb->Init();
    }
    else
    {
        //
    }
}
/**
 * @}
 */


/**
 * @addtogroup USBH_CORE_Local_Functions USBH Core Local Functions
 * @{
 */

/**
 * @brief  USBH_Connected
 *         USB Connect callback function from the Interrupt.
 * @param  selected device
 * @retval Status
 */
static uint8_t USBH_Connected (USB_OTG_CORE_HANDLE *pdev)
{
    pdev->host.ConnSts = 1U;
    return 0U;
}

/**
 * @brief  USBH_Disconnected
 *         USB Disconnect callback function from the Interrupt.
 * @param  selected device
 * @retval Status
 */
static uint8_t USBH_Disconnected (USB_OTG_CORE_HANDLE *pdev)
{
    pdev->host.ConnSts = 0U;
    return 0U;
}

/**
 * @brief  USBH_SOF
 *         USB SOF callback function from the Interrupt.
 * @param  selected device
 * @retval Status
 */
static uint8_t USBH_SOF (USB_OTG_CORE_HANDLE *pdev)
{
    /* This callback could be used to implement a scheduler process */
    return 0U;
}

/**
 * @brief  USBH_HandleEnum
 *         This function includes the complete enumeration process
 * @param  pdev: Selected device
 * @retval USBH_Status
 */
static USBH_Status USBH_HandleEnum(USB_OTG_CORE_HANDLE *pdev, USBH_HOST *phost)
{
    USBH_Status Status = USBH_BUSY;
    uint8_t Local_Buffer[64U];

